{
  "spell_level": 7,
  "source": "2024 Player's Handbook",
  "spells": [
    {
      "id": "conjure_celestial",
      "name": "Conjure Celestial",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["cleric"],
      "description": "You conjure a spirit from the Upper Planes. The spirit manifests in a heavenly form in an unoccupied space you can see within range. When the spirit appears, you make a ranged spell attack against one creature within 15 feet of it. On a hit, the target takes 4d12 + your spellcasting modifier Radiant damage. On a miss, the spell does nothing this turn. On each of your turns, you can use a Bonus Action to teleport the spirit up to 30 feet and repeat the attack.",
      "at_higher_levels": "The damage increases by 2d12 for each slot level above 7th."
    },
    {
      "id": "create_magen",
      "name": "Create Magen",
      "level": 7,
      "school": "Transmutation",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a vial of quicksilver worth 500+ GP and a life-sized human doll worth 5,000+ GP, both of which are consumed",
      "duration": "Instantaneous",
      "classes": ["wizard"],
      "description": "While casting the spell, you place a vial of quicksilver in the chest of a life-sized human doll stuffed with ash orite. You then stitch up the doll and imbue it with a life force. Roll a d8 to determine what kind of magen the spell creates."
    },
    {
      "id": "crown_of_stars",
      "name": "Crown of Stars",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S"],
      "duration": "1 hour",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "Seven star-like motes of light appear and orbit your head until the spell ends. You can use a Bonus Action to send one of the motes streaking toward one creature or object within 120 feet. When you do so, make a ranged spell attack. On a hit, the target takes 4d12 Radiant damage. Whether you hit or miss, the mote is expended. The spell ends early if you expend the last mote.",
      "at_higher_levels": "Two additional motes for each slot level above 7th."
    },
    {
      "id": "delayed_blast_fireball",
      "name": "Delayed Blast Fireball",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S", "M"],
      "material": "a ball of bat guano and sulfur",
      "duration": "Concentration, up to 1 minute",
      "classes": ["sorcerer", "wizard"],
      "description": "A beam of yellow light flashes from your pointing finger, then condenses to linger as a glowing bead. At the end of each of your turns, the bead's damage increases by 1d6. When the spell ends (either by you ending concentration or by someone touching the bead), the bead detonates. Each creature in a 20-foot-radius Sphere must make a Dexterity saving throw, taking 12d6 Fire damage (plus any accumulated damage) on a failed save.",
      "at_higher_levels": "The initial damage increases by 1d6 for each slot level above 7th."
    },
    {
      "id": "divine_word",
      "name": "Divine Word",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Bonus Action",
      "range": "30 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["cleric"],
      "description": "You utter a divine word, imbued with the power that shaped the world. Each creature of your choice that can hear you must make a Charisma saving throw. Effects based on current HP: 50+HP: Deafened for 1 minute. 40-49 HP: Deafened and Blinded for 10 minutes. 30-39 HP: Blinded, Deafened, and Stunned for 1 hour. Below 30 HP: Killed instantly."
    },
    {
      "id": "draconic_transformation",
      "name": "Draconic Transformation",
      "level": 7,
      "school": "Transmutation",
      "casting_time": "Bonus Action",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "a statuette of a dragon worth 500+ GP",
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "With a roar, you draw on the magic of dragons to transform yourself. You gain: Blindsight with a range of 30 feet, a Fly Speed of 60 feet, and a Breath Weapon (60-foot Cone, 6d8 Force damage, Dexterity save for half). You can use the Breath Weapon as a Bonus Action."
    },
    {
      "id": "dream_of_the_blue_veil",
      "name": "Dream of the Blue Veil",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "10 minutes",
      "range": "20 feet",
      "components": ["V", "S", "M"],
      "material": "a magic item or a willing creature from the destination world",
      "duration": "6 hours",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You and up to eight willing creatures within range fall Unconscious for the spell's duration and experience visions of another world. At the spell's end, you and the other creatures physically enter the world from which the material component originated."
    },
    {
      "id": "etherealness",
      "name": "Etherealness",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S"],
      "duration": "8 hours",
      "classes": ["bard", "cleric", "sorcerer", "warlock", "wizard"],
      "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. You can only affect and be affected by other creatures on the Ethereal Plane.",
      "at_higher_levels": "You can target up to three willing creatures (including you) for each slot level above 7th."
    },
    {
      "id": "finger_of_death",
      "name": "Finger of Death",
      "level": 7,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a Constitution saving throw, taking 7d8 + 30 Necrotic damage on a failed save, or half as much on a successful one. A humanoid killed by this spell rises at the start of your next turn as a Zombie permanently under your command."
    },
    {
      "id": "fire_storm",
      "name": "Fire Storm",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["cleric", "druid", "sorcerer"],
      "description": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot Cubes, which you can arrange as you wish. Each Cube must have at least one face adjacent to the face of another Cube. Each creature in the area must make a Dexterity saving throw, taking 7d10 Fire damage on a failed save, or half as much on a successful one."
    },
    {
      "id": "forcecage",
      "name": "Forcecage",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "100 feet",
      "components": ["V", "S", "M"],
      "material": "ruby dust worth 1,500+ GP, which the spell consumes",
      "duration": "1 hour",
      "classes": ["bard", "warlock", "wizard"],
      "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage (up to 20 feet on a side with bars 1/2 inch apart) or a solid box (up to 10 feet on a side). A creature can't leave the cage by nonmagical means. Teleportation requires a Charisma saving throw."
    },
    {
      "id": "mirage_arcane",
      "name": "Mirage Arcane",
      "level": 7,
      "school": "Illusion",
      "casting_time": "10 minutes",
      "range": "Sight",
      "components": ["V", "S"],
      "duration": "10 days",
      "classes": ["bard", "druid", "wizard"],
      "description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. Open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, or a rocky cliff like a gentle slope."
    },
    {
      "id": "mordenkainens_magnificent_mansion",
      "name": "Mordenkainen's Magnificent Mansion",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "1 minute",
      "range": "300 feet",
      "components": ["V", "S", "M"],
      "material": "a miniature portal carved from ivory, a polished piece of marble, and a silver spoon, each worth 5+ GP",
      "duration": "24 hours",
      "classes": ["bard", "wizard"],
      "description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance is 5 feet wide and 10 feet tall. The mansion consists of a foyer with numerous chambers beyond. The atmosphere is clean, fresh, and warm."
    },
    {
      "id": "mordenkainens_sword",
      "name": "Mordenkainen's Sword",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["V", "S", "M"],
      "material": "a miniature platinum sword worth 250+ GP",
      "duration": "Concentration, up to 1 minute",
      "classes": ["bard", "wizard"],
      "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration. When the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit, the target takes 4d12 Force damage. Until the spell ends, you can use a Bonus Action to move the sword up to 30 feet and repeat the attack."
    },
    {
      "id": "plane_shift",
      "name": "Plane Shift",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a forked, metal rod worth 250+ GP attuned to a particular plane",
      "duration": "Instantaneous",
      "classes": ["cleric", "druid", "sorcerer", "warlock", "wizard"],
      "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. Alternatively, you can use this spell to banish an unwilling creature to another plane. The target must succeed on a Charisma saving throw or be transported to the plane you specify."
    },
    {
      "id": "power_word_fortify",
      "name": "Power Word Fortify",
      "level": 7,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["bard", "cleric"],
      "description": "You speak a word of power that fortifies up to six creatures you can see within range. The spell bestows 120 Temporary Hit Points, which you divide among the targets as you choose."
    },
    {
      "id": "power_word_pain",
      "name": "Power Word Pain",
      "level": 7,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "You speak a word of power that causes waves of intense pain to assail one creature you can see within range. If the target has 100 Hit Points or fewer, it is subject to crippling pain. While affected, the target has its Speed reduced to 10 feet, Disadvantage on attack rolls, ability checks, and saving throws (except Constitution), and if it casts a spell, it must make a Constitution saving throw or the spell fails."
    },
    {
      "id": "prismatic_spray",
      "name": "Prismatic Spray",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "Self (60-foot cone)",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "Eight multicolored rays of light flash from your hand. Each ray is a different color with different effects. Each creature in a 60-foot Cone must make a Dexterity saving throw. For each target, roll a d8 to determine which color ray affects it: Red (12d6 Fire), Orange (12d6 Acid), Yellow (12d6 Lightning), Green (12d6 Poison), Blue (12d6 Cold), Indigo (Restrained then Petrified), Violet (Blinded then sent to another plane), 8 (struck by two rays)."
    },
    {
      "id": "project_image",
      "name": "Project Image",
      "level": 7,
      "school": "Illusion",
      "casting_time": "Action",
      "range": "500 miles",
      "components": ["V", "S", "M"],
      "material": "a replica of yourself worth 5+ GP",
      "duration": "Concentration, up to 1 day",
      "classes": ["bard", "wizard"],
      "description": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before. Your illusory double looks and sounds like you but is intangible. You can see through its eyes and hear through its ears. On each of your turns, you can switch from using your senses to the image's or vice versa."
    },
    {
      "id": "regenerate",
      "name": "Regenerate",
      "level": 7,
      "school": "Transmutation",
      "casting_time": "1 minute",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a prayer wheel",
      "duration": "1 hour",
      "classes": ["bard", "cleric", "druid"],
      "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 Hit Points. For the duration of the spell, the target regains 1 Hit Point at the start of each of its turns (10 Hit Points each minute). The target's severed body members are restored after 2 minutes."
    },
    {
      "id": "resurrection",
      "name": "Resurrection",
      "level": 7,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a diamond worth 1,000+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["bard", "cleric"],
      "description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't Undead. If its soul is free and willing, the target returns to life with all its Hit Points. This spell also neutralizes any poisons and cures normal diseases, and it closes all mortal wounds."
    },
    {
      "id": "reverse_gravity",
      "name": "Reverse Gravity",
      "level": 7,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "100 feet",
      "components": ["V", "S", "M"],
      "material": "a lodestone and iron filings",
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "You reverse gravity in a 50-foot-radius, 100-foot high Cylinder centered on a point within range. All creatures and objects not somehow anchored to the ground fall upward and reach the top of the area. A creature can make a Dexterity saving throw to grab onto a fixed object it can reach, thus avoiding the fall."
    },
    {
      "id": "sequester",
      "name": "Sequester",
      "level": 7,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "diamond, emerald, ruby, and sapphire dust worth 5,000+ GP, which the spell consumes",
      "duration": "Until dispelled",
      "classes": ["wizard"],
      "description": "By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. The target becomes Invisible and can't be targeted by Divination spells. If the target is a creature, it falls into a state of suspended animation. Time ceases to flow for it."
    },
    {
      "id": "simulacrum",
      "name": "Simulacrum",
      "level": 7,
      "school": "Illusion",
      "casting_time": "12 hours",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "powdered ruby worth 1,500+ GP, snow or ice in quantities sufficient to make a life-size copy, and items of clothing matching those worn by the creature",
      "duration": "Until dispelled",
      "classes": ["wizard"],
      "description": "You shape an illusory duplicate of one Beast or Humanoid that is within range for the entire casting time. The duplicate is a creature, partially real and formed from ice or snow. It can take actions and be affected as a normal creature. The simulacrum has half the creature's Hit Point maximum and lacks the ability to regain Hit Points or spell slots."
    },
    {
      "id": "symbol",
      "name": "Symbol",
      "level": 7,
      "school": "Abjuration",
      "casting_time": "1 minute",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "mercury, phosphorus, and diamond and opal dust worth 1,000+ GP, which the spell consumes",
      "duration": "Until dispelled or triggered",
      "classes": ["bard", "cleric", "druid", "wizard"],
      "description": "You inscribe a harmful glyph on a surface or within an object. When triggered, it affects each creature in a 60-foot-radius Sphere. Choose an effect: Death (10d10 Necrotic), Discord (argue for 1 minute), Fear (Frightened), Hopelessness (Despair for 1 minute), Insanity (Insane for 1 minute), Pain (Incapacitated for 1 minute), Sleep (Unconscious for 10 minutes), Stunning (Stunned for 1 minute)."
    },
    {
      "id": "teleport",
      "name": "Teleport",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "10 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "You teleport yourself and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. The destination can be anywhere on the same plane of existence. Familiarity with the destination determines accuracy."
    },
    {
      "id": "temple_of_the_gods",
      "name": "Temple of the Gods",
      "level": 7,
      "school": "Conjuration",
      "casting_time": "1 hour",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "a holy symbol worth 5+ GP",
      "duration": "24 hours",
      "classes": ["cleric"],
      "description": "You cause a temple to shimmer into existence on ground you can see within range. The temple is a 120-foot-square building with a 20-foot-high interior. The exterior can have any decoration you choose. Inside, the temple has an open ceiling. Celestials, Elementals, Fey, Fiends, and Undead can't enter unless you permit them."
    },
    {
      "id": "whirlwind",
      "name": "Whirlwind",
      "level": 7,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "300 feet",
      "components": ["V", "M"],
      "material": "a piece of straw",
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "A whirlwind howls down to a point on the ground you specify. The whirlwind is a 10-foot-radius, 30-foot-high Cylinder centered on that point. Until the spell ends, you can use a Magic action to move the whirlwind up to 30 feet. Each creature in the whirlwind's area must make a Dexterity saving throw, taking 10d6 Bludgeoning damage on a failed save. A Large or smaller creature that fails is also Restrained."
    }
  ]
}
