{
  "spell_level": 9,
  "source": "2024 Player's Handbook",
  "spells": [
    {
      "id": "astral_projection",
      "name": "Astral Projection",
      "level": 9,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "10 feet",
      "components": ["V", "S", "M"],
      "material": "for each creature you affect with this spell, one jacinth worth 1,000+ GP and one silver bar worth 100+ GP, all of which the spell consumes",
      "duration": "Until dispelled",
      "classes": ["cleric", "warlock", "wizard"],
      "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane. Your astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. You can return to your body at will. If your astral body is reduced to 0 Hit Points, you return to your body."
    },
    {
      "id": "blade_of_disaster",
      "name": "Blade of Disaster",
      "level": 9,
      "school": "Conjuration",
      "casting_time": "Bonus Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "You create a blade-shaped planar rift about 3 feet long in an unoccupied space you can see. The blade lasts for the duration. When you cast this spell, you can make up to two melee spell attacks with the blade on one or two targets within 5 feet of the blade. On a hit, the target takes 4d12 Force damage. On a roll of 18-20, the attack scores a Critical Hit (12d12 Force damage)."
    },
    {
      "id": "foresight",
      "name": "Foresight",
      "level": 9,
      "school": "Divination",
      "casting_time": "1 minute",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a hummingbird feather",
      "duration": "8 hours",
      "classes": ["bard", "druid", "warlock", "wizard"],
      "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can't be Surprised and has Advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have Disadvantage on attack rolls against the target."
    },
    {
      "id": "gate",
      "name": "Gate",
      "level": 9,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a diamond worth 5,000+ GP",
      "duration": "Concentration, up to 1 minute",
      "classes": ["cleric", "sorcerer", "warlock", "wizard"],
      "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. Any creature or object entering the portal instantly appears within 5 feet of the destination. You can also speak the true name of a specific creature, and if that creature is on another plane, the portal opens in the named creature's immediate vicinity."
    },
    {
      "id": "imprisonment",
      "name": "Imprisonment",
      "level": 9,
      "school": "Abjuration",
      "casting_time": "1 minute",
      "range": "30 feet",
      "components": ["V", "S", "M"],
      "material": "a statuette depicting the target, made from materials worth 500+ GP per Hit Die of the target",
      "duration": "Until dispelled",
      "classes": ["warlock", "wizard"],
      "description": "You create a magical restraint to hold a creature you can see within range. The target must succeed on a Wisdom saving throw or be bound by the spell. Choose one of the following forms of imprisonment: Burial, Chaining, Hedged Prison, Minimus Containment, or Slumber. The only way to free an imprisoned creature is to use a Wish spell or Dispel Magic (DC 19)."
    },
    {
      "id": "invulnerability",
      "name": "Invulnerability",
      "level": 9,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "diamond dust worth 500+ GP, which the spell consumes",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["wizard"],
      "description": "You are immune to all damage until the spell ends."
    },
    {
      "id": "mass_heal",
      "name": "Mass Heal",
      "level": 9,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["cleric"],
      "description": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 Hit Points, divided as you choose among any number of creatures that you can see within range. This spell also ends the Blinded, Deafened, and Poisoned conditions on any creatures you restore."
    },
    {
      "id": "mass_polymorph",
      "name": "Mass Polymorph",
      "level": 9,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "a caterpillar cocoon",
      "duration": "Concentration, up to 1 hour",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "You transform up to ten creatures of your choice that you can see within range. An unwilling target must succeed on a Wisdom saving throw to resist the transformation. Each target assumes a Beast form of your choice with a Challenge Rating equal to or less than the target's Challenge Rating or level."
    },
    {
      "id": "meteor_swarm",
      "name": "Meteor Swarm",
      "level": 9,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "1 mile",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["sorcerer", "wizard"],
      "description": "Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius Sphere centered on each point makes a Dexterity saving throw, taking 40d6 Fire damage on a failed save, or half as much on a successful one. A creature in the area of more than one fiery burst is affected only once. The spell damages objects in the area."
    },
    {
      "id": "power_word_heal",
      "name": "Power Word Heal",
      "level": 9,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["bard", "cleric"],
      "description": "A wave of healing energy washes over one creature you can see within range. The target regains all its Hit Points. If the creature has the Charmed, Frightened, Paralyzed, Poisoned, or Stunned condition, the condition ends. If the creature has the Prone condition, it can use its Reaction to stand up."
    },
    {
      "id": "power_word_kill",
      "name": "Power Word Kill",
      "level": 9,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You utter a word of power that can compel one creature you can see within range to die instantly. If the creature you choose has 100 Hit Points or fewer, it dies. Otherwise, the spell has no effect."
    },
    {
      "id": "prismatic_wall",
      "name": "Prismatic Wall",
      "level": 9,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "10 minutes",
      "classes": ["bard", "wizard"],
      "description": "A shimmering, multicolored plane of light forms a vertical opaque wall up to 90 feet long, 30 feet high, and 1 inch thick, or a sphere up to 30 feet in diameter. The wall sheds Bright Light in a 100-foot radius and Dim Light for an additional 100 feet. The wall consists of seven layers, each with a different color. To pass through or reach beyond the wall, a creature must pass through all seven layers."
    },
    {
      "id": "psychic_scream",
      "name": "Psychic Scream",
      "level": 9,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["S"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You unleash the power of your mind to blast the intellect of up to ten creatures of your choice that you can see within range. Each target must make an Intelligence saving throw, taking 14d6 Psychic damage on a failed save, or half as much on a successful one. If a target fails its saving throw, it also has the Stunned condition. A Stunned target can make an Intelligence saving throw at the end of each of its turns; on a successful save, the Stunning effect ends."
    },
    {
      "id": "ravenous_void",
      "name": "Ravenous Void",
      "level": 9,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "1,000 feet",
      "components": ["V", "S", "M"],
      "material": "a small, nine-pointed star made of iron",
      "duration": "Concentration, up to 1 minute",
      "classes": ["wizard"],
      "description": "You create a 20-foot-radius Sphere of destructive gravitational force centered on a point you can see within range. A creature in the Sphere must make a Strength saving throw or take 5d10 Force damage and be pulled to the center of the sphere. The center is considered Difficult Terrain and deals 5d10 Force damage to creatures that enter or start their turn there."
    },
    {
      "id": "shapechange",
      "name": "Shapechange",
      "level": 9,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "a jade circlet worth 1,500+ GP",
      "duration": "Concentration, up to 1 hour",
      "classes": ["druid", "wizard"],
      "description": "You assume the form of a different creature for the duration. The new form can be of any creature with a Challenge Rating equal to your level or lower. You transform into an average example of that creature, one without any class levels. Your game statistics are replaced by the statistics of the chosen creature, but you retain your personality and Intelligence, Wisdom, and Charisma scores."
    },
    {
      "id": "storm_of_vengeance",
      "name": "Storm of Vengeance",
      "level": 9,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "Sight",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid"],
      "description": "A churning storm cloud forms, centered on a point you can see. The cloud is a 360-foot-radius, 100-foot-tall Cylinder. When you cast the spell and at the start of each of your turns thereafter, different effects occur: Round 1 (Lightning and Thunder), Round 2-3 (Acid Rain), Round 4 (Hailstones), Round 5-10 (Gusts and Freezing Rain)."
    },
    {
      "id": "time_ravage",
      "name": "Time Ravage",
      "level": 9,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["V", "S", "M"],
      "material": "an hourglass filled with diamond dust worth 5,000+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["wizard"],
      "description": "You target a creature you can see within range, putting its physical form through the ravages of time. The target must make a Constitution saving throw, taking 10d12 Necrotic damage on a failed save, or half as much on a successful one. If the target fails, it also ages to the point where it has only 30 days left before it dies of old age."
    },
    {
      "id": "time_stop",
      "name": "Time Stop",
      "level": 9,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["sorcerer", "wizard"],
      "description": "You briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal. This spell ends if one of the actions you use during this period, or any effects that you create during this period, affects a creature other than you or an object being worn or carried by someone other than you."
    },
    {
      "id": "true_polymorph",
      "name": "True Polymorph",
      "level": 9,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S", "M"],
      "material": "a drop of mercury, a dollop of gum arabic, and a wisp of smoke",
      "duration": "Concentration, up to 1 hour",
      "classes": ["bard", "warlock", "wizard"],
      "description": "Choose one creature or nonmagical object within range. You transform the creature into a different creature, the creature into a nonmagical object, or the object into a creature. The transformation lasts for the duration, or until the target drops to 0 Hit Points or dies. If you concentrate on this spell for the full duration, the transformation becomes permanent."
    },
    {
      "id": "true_resurrection",
      "name": "True Resurrection",
      "level": 9,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "diamonds worth 25,000+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["cleric", "druid"],
      "description": "You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. If the creature's soul is free and willing, the creature is restored to life with all its Hit Points. This spell closes all wounds, neutralizes any poisons, cures all diseases, and lifts any curses affecting the creature when it died. The spell can even provide a new body if the original no longer exists."
    },
    {
      "id": "weird",
      "name": "Weird",
      "level": 9,
      "school": "Illusion",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["warlock", "wizard"],
      "description": "Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, visible only to them. Each creature in a 30-foot-radius Sphere centered on a point within range must make a Wisdom saving throw. On a failed save, a creature has the Frightened condition for the duration. A Frightened creature takes 4d10 Psychic damage at the start of each of its turns."
    },
    {
      "id": "wish",
      "name": "Wish",
      "level": 9,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["sorcerer", "wizard"],
      "description": "Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. The basic use of this spell is to duplicate any other spell of level 8 or lower without meeting requirements or components. Alternatively, you can create other effects at the DM's discretion. The stress of casting this spell to produce any effect other than duplicating another spell weakens you: 1d10 Necrotic damage per level of spell duplicated (if any), Strength drops to 3, and a 33% chance of never casting Wish again.",
      "safe_uses": [
        "Duplicate any spell of 8th level or lower",
        "Create an object worth up to 25,000 GP",
        "Grant up to 10 creatures resistance to a damage type",
        "Grant up to 10 creatures immunity to a spell or magical effect for 8 hours",
        "Undo a single recent event (force reroll with Disadvantage)",
        "Restore up to 20 creatures to full Hit Points"
      ]
    }
  ]
}
