{
  "spell_level": 5,
  "source": "2024 Player's Handbook",
  "spells": [
    {
      "id": "animate_objects",
      "name": "Animate Objects",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four. You can't animate any object larger than Large. Each target animates and becomes a construct using the Animated Object stat block.",
      "at_higher_levels": "You can animate two additional objects for each slot level above 5th."
    },
    {
      "id": "antilife_shell",
      "name": "Antilife Shell",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self (10-foot emanation)",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["druid"],
      "description": "A shimmering barrier extends out from you in a 10-foot Emanation and moves with you, remaining centered on you and hedging out creatures other than Undead and Constructs. A creature can't pass through or reach through the barrier."
    },
    {
      "id": "awaken",
      "name": "Awaken",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "8 hours",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "an agate worth 1,000+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["bard", "druid"],
      "description": "You spend the casting time tracing magical pathways within a precious gemstone, and then touch a Huge or smaller Beast or plant. The target must have an Intelligence score of 3 or less. The target gains an Intelligence of 10 and the ability to speak one language you know. A Beast becomes a Fey."
    },
    {
      "id": "banishing_smite",
      "name": "Banishing Smite",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Bonus Action, after hitting with a melee weapon",
      "range": "Self",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["paladin"],
      "description": "Your strike rings with supernatural power. The target takes an extra 5d10 Force damage. If this attack reduces the target to 50 Hit Points or fewer, the target must succeed on a Charisma saving throw or be transported to a harmless demiplane, where it has the Incapacitated condition, for 1 minute. The target then returns.",
      "at_higher_levels": "The damage increases by 1d10 for each slot level above 5th."
    },
    {
      "id": "bigbys_hand",
      "name": "Bigby's Hand",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "an eggshell and a snakeskin glove",
      "duration": "Concentration, up to 1 minute",
      "classes": ["sorcerer", "wizard"],
      "description": "You create a Large hand of shimmering, translucent force. The hand lasts for the duration and obeys your commands. The hand can move up to 60 feet as a Bonus Action. You can use it for: Clenched Fist (melee attack 4d8 Force), Forceful Hand (push target), Grasping Hand (grapple), Interposing Hand (+5 AC, half cover).",
      "at_higher_levels": "The Clenched Fist and Grasping Hand damage increase by 2d8 for each slot level above 5th."
    },
    {
      "id": "circle_of_power",
      "name": "Circle of Power",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self (30-foot emanation)",
      "components": ["V"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["cleric", "paladin"],
      "description": "Divine energy radiates from you in a 30-foot Emanation, distorting and diffusing magical energy. Until the spell ends, each ally in the Emanation (including you) has Advantage on saving throws against spells and other magical effects. Additionally, when an affected creature succeeds on a saving throw against a spell or magical effect, it takes no damage if it would normally take half damage."
    },
    {
      "id": "cloudkill",
      "name": "Cloudkill",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["sorcerer", "wizard"],
      "description": "You create a 20-foot-radius Sphere of yellow-green fog centered on a point within range. The fog spreads around corners and is Heavily Obscured. A creature that enters the Sphere for the first time on a turn or starts its turn there must make a Constitution saving throw, taking 5d8 Poison damage on a failed save, or half on a success. The fog moves 10 feet away from you at the start of each of your turns.",
      "at_higher_levels": "The damage increases by 1d8 for each slot level above 5th."
    },
    {
      "id": "commune",
      "name": "Commune",
      "level": 5,
      "school": "Divination",
      "ritual": true,
      "casting_time": "1 minute",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "incense",
      "duration": "1 minute",
      "classes": ["cleric"],
      "description": "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question. Divine beings aren't necessarily omniscient, so you might receive 'unclear' as an answer."
    },
    {
      "id": "commune_with_nature",
      "name": "Commune with Nature",
      "level": 5,
      "school": "Divination",
      "ritual": true,
      "casting_time": "1 minute",
      "range": "Self",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["druid", "ranger"],
      "description": "You become one with nature and gain knowledge of the surrounding territory. Outdoors, the spell gives you knowledge of the land within 3 miles of you. You gain knowledge of up to three of the following: terrain and bodies of water, prevalent plants/minerals/animals/peoples, powerful celestials/fey/fiends/elementals/undead, buildings, and other presence."
    },
    {
      "id": "cone_of_cold",
      "name": "Cone of Cold",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "Self (60-foot cone)",
      "components": ["V", "S", "M"],
      "material": "a small crystal or glass cone",
      "duration": "Instantaneous",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "A blast of cold air erupts from your hands. Each creature in a 60-foot Cone originating from you makes a Constitution saving throw, taking 8d8 Cold damage on a failed save or half as much on a successful one. A creature killed by this spell becomes a frozen statue until it thaws.",
      "at_higher_levels": "The damage increases by 1d8 for each slot level above 5th."
    },
    {
      "id": "conjure_elemental",
      "name": "Conjure Elemental",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["druid", "wizard"],
      "description": "You conjure a Large, intangible elemental. It manifests in an unoccupied space you can see within range. The spirit lasts for the spell's duration. Choose Air, Earth, Fire, or Water. When a creature you can see enters the Emanation for the first time on a turn or starts its turn there, it must make a Dexterity save. On a failed save, it takes 8d8 damage of a type determined by the element chosen.",
      "at_higher_levels": "The damage increases by 2d8 for each slot level above 5th."
    },
    {
      "id": "conjure_volley",
      "name": "Conjure Volley",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S", "M"],
      "material": "a piece of ammunition or a weapon",
      "duration": "Instantaneous",
      "classes": ["ranger"],
      "description": "You fire a piece of nonmagical ammunition from a ranged weapon or throw a nonmagical weapon into the air and choose a point within range. Hundreds of duplicates of the ammunition or weapon fall in a volley. Each creature in a 40-foot-radius, 20-foot-high Cylinder centered on that point must make a Dexterity saving throw, taking 8d8 Force damage on a failed save, or half as much on a successful one."
    },
    {
      "id": "contact_other_plane",
      "name": "Contact Other Plane",
      "level": 5,
      "school": "Divination",
      "ritual": true,
      "casting_time": "1 minute",
      "range": "Self",
      "components": ["V"],
      "duration": "1 minute",
      "classes": ["warlock", "wizard"],
      "description": "You mentally contact a demigod, the spirit of a long-dead sage, or some other mysterious entity from another plane. Contacting this extraplanar intelligence can strain your mind. When you cast this spell, make a DC 15 Intelligence saving throw. On a failure, you take 6d6 Psychic damage and have the Insane condition until you finish a Long Rest. On a success, you can ask up to five questions."
    },
    {
      "id": "contagion",
      "name": "Contagion",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S"],
      "duration": "7 days",
      "classes": ["cleric", "druid"],
      "description": "Your touch inflicts a magical contagion. Make a melee spell attack against a creature within reach. On a hit, the target has the Poisoned condition, and you infect the target with a disease of your choice: Blinding Sickness, Filth Fever, Flesh Rot, Mindfire, Seizure, or Slimy Doom."
    },
    {
      "id": "control_winds",
      "name": "Control Winds",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "300 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "You take control of the air in a 100-foot Cube that you can see within range. Choose one of these effects when you cast the spell. You can change the effect as an action on your turns: Gusts (Difficult Terrain), Downdraft (flying creatures fall), Updraft (creatures can jump higher and falling creatures take less damage)."
    },
    {
      "id": "creation",
      "name": "Creation",
      "level": 5,
      "school": "Illusion",
      "casting_time": "1 minute",
      "range": "30 feet",
      "components": ["V", "S", "M"],
      "material": "a piece of the material to be created",
      "duration": "Special",
      "classes": ["sorcerer", "wizard"],
      "description": "You pull wisps of shadow material from the Shadowfell to create a nonliving object within range: soft goods, rope, wood, or something similar. You can also use this spell to create mineral objects such as stone, crystal, or metal. The duration depends on the material: vegetable matter (1 day), stone/crystal (12 hours), precious metals (1 hour), gems (10 minutes).",
      "at_higher_levels": "The Cube increases by 5 feet for each slot level above 5th."
    },
    {
      "id": "danse_macabre",
      "name": "Danse Macabre",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["warlock", "wizard"],
      "description": "Threads of dark power leap from your fingers to pierce up to five Small or Medium corpses you can see within range. Each corpse immediately stands up and becomes Undead. You decide whether it is a Zombie or a Skeleton, and it uses those stat blocks. A creature you create with this spell adds your proficiency bonus to attack and damage rolls.",
      "at_higher_levels": "You animate two additional corpses for each slot level above 5th."
    },
    {
      "id": "dawn",
      "name": "Dawn",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a sunburst pendant worth 100+ GP",
      "duration": "Concentration, up to 1 minute",
      "classes": ["cleric", "wizard"],
      "description": "The light of dawn shines down on a location you specify within range. A 30-foot-radius, 40-foot-high Cylinder of bright light appears. When a creature enters the Cylinder for the first time on a turn or starts its turn there, it must make a Constitution saving throw, taking 4d10 Radiant damage on a failed save, or half on a success. You can move the Cylinder up to 60 feet as a Bonus Action."
    },
    {
      "id": "destructive_wave",
      "name": "Destructive Wave",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "Self (30-foot emanation)",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["paladin"],
      "description": "You strike the ground, creating a burst of divine energy. Each creature you choose within 30 feet of you must succeed on a Constitution saving throw or take 5d6 Thunder damage, as well as 5d6 Radiant or Necrotic damage (your choice), and have the Prone condition. A creature that succeeds on its saving throw takes half as much damage and isn't knocked Prone."
    },
    {
      "id": "dispel_evil_and_good",
      "name": "Dispel Evil and Good",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "powdered silver and iron",
      "duration": "Concentration, up to 1 minute",
      "classes": ["cleric", "paladin"],
      "description": "Shimmering energy surrounds and protects you from Aberrations, Celestials, Elementals, Fey, Fiends, and Undead. Creatures of those types have Disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions: Break Enchantment (touch to end charmed/frightened/possessed) or Dismissal (melee spell attack to send creature to its home plane)."
    },
    {
      "id": "dominate_person",
      "name": "Dominate Person",
      "level": 5,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "One Humanoid you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target has Advantage on the save if you or your allies are fighting it. While the target is Charmed, you have a telepathic link with it. You can use your Reaction to take total and precise control of the target.",
      "at_higher_levels": "5th level: 10 minutes. 6th level: 1 hour. 7th level+: 8 hours."
    },
    {
      "id": "dream",
      "name": "Dream",
      "level": 5,
      "school": "Illusion",
      "casting_time": "1 minute",
      "range": "Special",
      "components": ["V", "S", "M"],
      "material": "a handful of sand",
      "duration": "8 hours",
      "classes": ["bard", "warlock", "wizard"],
      "description": "You, or a willing creature you touch, enters a trance state and acts as a messenger to send a dream message to a creature you name. The messenger can emerge from the trance at any time, ending the spell early. The target awakens from the trance when the spell ends and retains a perfect memory of the dream."
    },
    {
      "id": "enervation",
      "name": "Enervation",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "A tendril of inky darkness reaches out from you, touching a creature you can see within range to drain life from it. The target makes a Dexterity saving throw. On a failed save, the target takes 4d8 Necrotic damage, and until the spell ends, you can use a Bonus Action to deal 4d8 Necrotic damage automatically. On a success, the target takes half damage and the spell ends.",
      "at_higher_levels": "The damage increases by 1d8 for each slot level above 5th."
    },
    {
      "id": "far_step",
      "name": "Far Step",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Bonus Action",
      "range": "Self",
      "components": ["V"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "You teleport up to 60 feet to an unoccupied space you can see. On each of your turns before the spell ends, you can use a Bonus Action to teleport in this way again."
    },
    {
      "id": "flame_strike",
      "name": "Flame Strike",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a pinch of sulfur",
      "duration": "Instantaneous",
      "classes": ["cleric"],
      "description": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high Cylinder centered on a point within range must make a Dexterity saving throw, taking 5d6 Fire damage and 5d6 Radiant damage on a failed save, or half as much on a success.",
      "at_higher_levels": "The Fire damage and Radiant damage each increase by 1d6 for each slot level above 5th."
    },
    {
      "id": "geas",
      "name": "Geas",
      "level": 5,
      "school": "Enchantment",
      "casting_time": "1 minute",
      "range": "60 feet",
      "components": ["V"],
      "duration": "30 days",
      "classes": ["bard", "cleric", "druid", "paladin", "wizard"],
      "description": "You place a magical command on a creature you can see within range, forcing it to carry out some service or refrain from some action or course of activity. The creature must succeed on a Wisdom saving throw or have the Charmed condition for the duration. While Charmed, the creature takes 5d10 Psychic damage each time it acts against your instructions.",
      "at_higher_levels": "7th level: 1 year. 9th level: until dispelled."
    },
    {
      "id": "greater_restoration",
      "name": "Greater Restoration",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "diamond dust worth 100+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["bard", "cleric", "druid", "ranger"],
      "description": "You touch a creature and choose one effect to end on it: one Charmed or Petrified condition, one curse, any reduction to one ability score, or any reduction to the target's Hit Point maximum."
    },
    {
      "id": "hallow",
      "name": "Hallow",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "24 hours",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "herbs, oils, and incense worth 1,000+ GP, which the spell consumes",
      "duration": "Until dispelled",
      "classes": ["cleric"],
      "description": "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet. The affected area has the following effects: Celestials, Elementals, Fey, Fiends, and Undead can't enter the area, and can't charm, frighten, or possess creatures in the area. You can also bind an extra effect to the area."
    },
    {
      "id": "hold_monster",
      "name": "Hold Monster",
      "level": 5,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["V", "S", "M"],
      "material": "a straight piece of iron",
      "duration": "Concentration, up to 1 minute",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "Choose a creature you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success.",
      "at_higher_levels": "You can target one additional creature for each slot level above 5th."
    },
    {
      "id": "holy_weapon",
      "name": "Holy Weapon",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Bonus Action",
      "range": "Touch",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["cleric", "paladin"],
      "description": "You imbue a weapon you touch with holy power. Until the spell ends, the weapon emits Bright Light in a 30-foot radius and Dim Light for an additional 30 feet. In addition, weapon attacks made with it deal an extra 2d8 Radiant damage on a hit. If the weapon isn't already a magic weapon, it becomes one for the duration."
    },
    {
      "id": "infernal_calling",
      "name": "Infernal Calling",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "1 minute",
      "range": "90 feet",
      "components": ["V", "S", "M"],
      "material": "a ruby worth 999+ GP",
      "duration": "Concentration, up to 1 hour",
      "classes": ["warlock", "wizard"],
      "description": "Uttering a dark incantation, you summon a Devil from the Nine Hells. You choose the devil's type, which must be of Challenge Rating 6 or lower. The devil appears in an unoccupied space you can see within range. The devil is unfriendly toward you and your companions but will follow your commands if you have its true name.",
      "at_higher_levels": "The devil's maximum Challenge Rating increases by 1 for each slot level above 5th."
    },
    {
      "id": "insect_plague",
      "name": "Insect Plague",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "300 feet",
      "components": ["V", "S", "M"],
      "material": "a locust",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["cleric", "druid", "sorcerer"],
      "description": "Swarming, biting locusts fill a 20-foot-radius Sphere centered on a point you choose within range. The area is Lightly Obscured and Difficult Terrain. A creature that enters the area for the first time on a turn or starts its turn there must make a Constitution saving throw, taking 4d10 Piercing damage on a failed save, or half as much on a successful one.",
      "at_higher_levels": "The damage increases by 1d10 for each slot level above 5th."
    },
    {
      "id": "legend_lore",
      "name": "Legend Lore",
      "level": 5,
      "school": "Divination",
      "casting_time": "10 minutes",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "incense worth 250+ GP which the spell consumes, and four ivory strips worth 50+ GP each",
      "duration": "Instantaneous",
      "classes": ["bard", "cleric", "wizard"],
      "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known."
    },
    {
      "id": "maelstrom",
      "name": "Maelstrom",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "paper or leaf in the shape of a funnel",
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid"],
      "description": "A swirling mass of 5-foot-deep water appears in a 30-foot radius centered on a point you can see within range. The area is Difficult Terrain. Any creature in the area when you cast the spell must succeed on a Strength saving throw or take 6d6 Bludgeoning damage and be pulled 10 feet toward the center."
    },
    {
      "id": "mass_cure_wounds",
      "name": "Mass Cure Wounds",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["bard", "cleric", "druid"],
      "description": "A wave of healing energy washes out from a point within range. Choose up to six creatures in a 30-foot-radius Sphere centered on that point. Each target regains Hit Points equal to 5d8 + your spellcasting ability modifier.",
      "at_higher_levels": "The healing increases by 1d8 for each slot level above 5th."
    },
    {
      "id": "mislead",
      "name": "Mislead",
      "level": 5,
      "school": "Illusion",
      "casting_time": "Action",
      "range": "Self",
      "components": ["S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["bard", "warlock", "wizard"],
      "description": "You gain the Invisible condition at the same time that an illusory double of you appears where you are standing. The double lasts for the duration. You can use a Bonus Action to move the double up to twice your Speed and make it gesture, speak, and behave in whatever way you choose."
    },
    {
      "id": "modify_memory",
      "name": "Modify Memory",
      "level": 5,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["bard", "wizard"],
      "description": "You attempt to reshape another creature's memories. One creature you can see within range must make a Wisdom saving throw. If you are fighting it, it has Advantage on the save. On a failed save, the target has the Charmed condition for the duration and you can reshape its memories of an event that took place within the last 24 hours.",
      "at_higher_levels": "6th: 7 days. 7th: 30 days. 8th: 1 year. 9th: any time in past."
    },
    {
      "id": "negative_energy_flood",
      "name": "Negative Energy Flood",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "M"],
      "material": "a broken bone and a square of black silk",
      "duration": "Instantaneous",
      "classes": ["warlock", "wizard"],
      "description": "You send ribbons of negative energy at one creature you can see within range. The target must make a Constitution saving throw, taking 5d12 Necrotic damage on a failed save, or half as much on a successful one. A target killed by this damage rises at the start of your next turn as a Zombie under your command."
    },
    {
      "id": "passwall",
      "name": "Passwall",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S", "M"],
      "material": "a pinch of sesame seeds",
      "duration": "1 hour",
      "classes": ["wizard"],
      "description": "A passage appears at a point within range that you can see on a wooden, plaster, or stone surface (such as a wall, ceiling, or floor). The passage is 5 feet wide, 8 feet tall, and 20 feet deep. The passage creates no instability in a structure surrounding it."
    },
    {
      "id": "planar_binding",
      "name": "Planar Binding",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "1 hour",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a jewel worth 1,000+ GP, which the spell consumes",
      "duration": "24 hours",
      "classes": ["bard", "cleric", "druid", "warlock", "wizard"],
      "description": "You attempt to bind a Celestial, an Elemental, a Fey, a Fiend, or an Aberration to your service. The creature must be within range for the entire casting of the spell. At the completion of the casting, the target must make a Charisma saving throw. On a failed save, it is bound to serve you for the duration.",
      "at_higher_levels": "6th: 10 days. 7th: 30 days. 8th: 180 days. 9th: 1 year and a day."
    },
    {
      "id": "raise_dead",
      "name": "Raise Dead",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a diamond worth 500+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["bard", "cleric", "paladin"],
      "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 Hit Point. The target takes a -4 penalty to D20 Tests, which reduces by 1 after each Long Rest."
    },
    {
      "id": "rarys_telepathic_bond",
      "name": "Rary's Telepathic Bond",
      "level": 5,
      "school": "Divination",
      "ritual": true,
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S", "M"],
      "material": "two eggs",
      "duration": "1 hour",
      "classes": ["bard", "wizard"],
      "description": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with Intelligence scores of 2 or less aren't affected. Until the spell ends, the targets can communicate telepathically through the bond."
    },
    {
      "id": "reincarnate",
      "name": "Reincarnate",
      "level": 5,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "rare oils worth 1,000+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["druid"],
      "description": "You touch a dead Humanoid or a piece of a dead Humanoid. Provided that the creature has been dead no longer than 10 days, the spell forms a new adult body for it and then calls the soul to enter that body. Roll d10 or DM chooses to determine what Species the creature becomes: 1-Aasimar, 2-Dragonborn, 3-Dwarf, 4-Elf, 5-Gnome, 6-Goliath, 7-Halfling, 8-Human, 9-Orc, 10-Tiefling."
    },
    {
      "id": "scrying",
      "name": "Scrying",
      "level": 5,
      "school": "Divination",
      "casting_time": "10 minutes",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "a focus worth 1,000+ GP (a crystal ball, silver mirror, or font filled with holy water)",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["bard", "cleric", "druid", "warlock", "wizard"],
      "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by familiarity and connection. On a failed save, the spell creates an invisible sensor within 10 feet of the target."
    },
    {
      "id": "seeming",
      "name": "Seeming",
      "level": 5,
      "school": "Illusion",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S"],
      "duration": "8 hours",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "You give an illusory appearance to each creature of your choice that you can see within 30 feet of you. An unwilling target can make a Charisma saving throw, and if it succeeds, it is unaffected by this spell. You can make a creature seem 1 foot shorter or taller and appear thin, fat, or in between."
    },
    {
      "id": "skill_empowerment",
      "name": "Skill Empowerment",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["bard", "sorcerer", "wizard"],
      "description": "Your magic deepens a creature's understanding of its own talent. You touch one willing creature and give it Expertise in one skill of your choice; until this spell ends, the creature doubles its proficiency bonus for ability checks it makes that use the chosen skill."
    },
    {
      "id": "steel_wind_strike",
      "name": "Steel Wind Strike",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["S", "M"],
      "material": "a melee weapon worth 1+ SP",
      "duration": "Instantaneous",
      "classes": ["ranger", "wizard"],
      "description": "You flourish the weapon used in the casting and then vanish to strike like the wind. Choose up to five creatures you can see within range. Make a melee spell attack against each target. On a hit, a target takes 6d10 Force damage. You can then teleport to an unoccupied space you can see within 5 feet of one of the targets."
    },
    {
      "id": "summon_celestial",
      "name": "Summon Celestial",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "90 feet",
      "components": ["V", "S", "M"],
      "material": "a golden reliquary worth 500+ GP",
      "duration": "Concentration, up to 1 hour",
      "classes": ["cleric", "paladin"],
      "description": "You call forth a celestial spirit. It manifests in an unoccupied space you can see within range. The spirit uses the Celestial Spirit stat block. When you cast this spell, choose Avenger or Defender. Your choice determines certain traits in its stat block.",
      "at_higher_levels": "For each slot level above 5th, AC increases by 1, Hit Points increase by 10, and damage increases by 1d10."
    },
    {
      "id": "summon_draconic_spirit",
      "name": "Summon Draconic Spirit",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "an object with the image of a dragon engraved on it, worth 500+ GP",
      "duration": "Concentration, up to 1 hour",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "You call forth a draconic spirit. It manifests in an unoccupied space you can see within range. The spirit uses the Draconic Spirit stat block. When you cast this spell, choose a damage type: Acid, Cold, Fire, Lightning, or Poison.",
      "at_higher_levels": "For each slot level above 5th, the creature uses more Hit Dice, and the breath weapon damage increases by 1d6."
    },
    {
      "id": "swift_quiver",
      "name": "Swift Quiver",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Bonus Action",
      "range": "Self",
      "components": ["V", "S", "M"],
      "material": "a quiver",
      "duration": "Concentration, up to 1 minute",
      "classes": ["ranger"],
      "description": "When you take the Attack action on your turn, you can make two additional attacks as a Bonus Action. Each of those attacks must be a ranged weapon attack using a weapon from a quiver. If the quiver is empty, it magically replenishes with nonmagical ammunition for the duration."
    },
    {
      "id": "synaptic_static",
      "name": "Synaptic Static",
      "level": 5,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You choose a point within range and cause psychic energy to explode there. Each creature in a 20-foot-radius Sphere centered on that point must make an Intelligence saving throw, taking 8d6 Psychic damage on a failed save, or half as much on a successful one. After a failed save, a target has muddled thoughts for 1 minute. During that time, it rolls a d6 and subtracts the number rolled from all its attack rolls and ability checks."
    },
    {
      "id": "telekinesis",
      "name": "Telekinesis",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["sorcerer", "wizard"],
      "description": "You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell, choose one of the following effects. As a Magic action on your turns, you can use the same effect or choose a different one: Creature (move up to 30 feet if it fails Strength contest), Object (move object up to 30 feet)."
    },
    {
      "id": "teleportation_circle",
      "name": "Teleportation Circle",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "1 minute",
      "range": "10 feet",
      "components": ["V", "M"],
      "material": "rare chalks and inks infused with precious gems worth 50+ GP, which the spell consumes",
      "duration": "1 round",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You draw a 10-foot-diameter circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you know and that is on the same plane of existence. A shimmering portal opens within the circle and remains open until the end of your next turn."
    },
    {
      "id": "transmute_rock",
      "name": "Transmute Rock",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "clay and water",
      "duration": "Until dispelled",
      "classes": ["druid", "wizard"],
      "description": "You choose an area of stone or mud that you can see that fits within a 40-foot cube and is within range, and choose one of the following effects: Transmute Rock to Mud (creatures in area may sink) or Transmute Mud to Rock (creatures in area may become Restrained)."
    },
    {
      "id": "tree_stride",
      "name": "Tree Stride",
      "level": 5,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "ranger"],
      "description": "You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. Once inside, you can use your remaining movement to enter another tree or emerge from the tree you're in."
    },
    {
      "id": "wall_of_force",
      "name": "Wall of Force",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "a shard of glass",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["wizard"],
      "description": "An invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose: horizontally, vertically, or diagonally. The wall can be up to 100 feet long, 20 feet high, and 1/4 inch thick, or a hemispherical dome or globe with a radius of up to 10 feet. Nothing can physically pass through the wall. It is immune to all damage."
    },
    {
      "id": "wall_of_light",
      "name": "Wall of Light",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "a hand mirror",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "A shimmering wall of bright light appears at a point you choose within range. The wall can be up to 60 feet long, 10 feet high, and 5 feet thick. When the wall appears, each creature in its area must make a Constitution saving throw, taking 4d8 Radiant damage on a failed save, or half as much on a success. A creature has the Blinded condition while in the wall's area.",
      "at_higher_levels": "The damage increases by 1d8 for each slot level above 5th."
    },
    {
      "id": "wall_of_stone",
      "name": "Wall of Stone",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S", "M"],
      "material": "a cube of granite",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice). Each 10-foot section has AC 15 and 30 Hit Points per inch of thickness."
    },
    {
      "id": "wrath_of_nature",
      "name": "Wrath of Nature",
      "level": 5,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "ranger"],
      "description": "You call out to the spirits of nature to rouse them against your enemies. Choose a point within range. The spirits cause trees, rocks, and grasses in a 60-foot Cube centered on that point to become animated. Grasses and undergrowth create Difficult Terrain. Trees (4d6 Slashing damage). Roots and Vines (Restrained condition). Rocks (3d8 Bludgeoning damage)."
    }
  ]
}
