{
  "spell_level": 8,
  "source": "2024 Player's Handbook",
  "spells": [
    {
      "id": "abi_dalzims_horrid_wilting",
      "name": "Abi-Dalzim's Horrid Wilting",
      "level": 8,
      "school": "Necromancy",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S", "M"],
      "material": "a sponge",
      "duration": "Instantaneous",
      "classes": ["sorcerer", "wizard"],
      "description": "You draw the moisture from every creature in a 30-foot Cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and Undead aren't affected. A creature takes 12d8 Necrotic damage on a failed save, or half as much on a successful one. Plant creatures and magical plants have Disadvantage on this saving throw and take maximum damage."
    },
    {
      "id": "animal_shapes",
      "name": "Animal Shapes",
      "level": 8,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "30 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 24 hours",
      "classes": ["druid"],
      "description": "You transform any number of willing creatures within range into Beast forms of your choice. On each of your turns, you can use your Magic action to transform affected creatures into new forms. The transformation lasts for the duration or until a target drops to 0 Hit Points or dies."
    },
    {
      "id": "antimagic_field",
      "name": "Antimagic Field",
      "level": 8,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self (10-foot emanation)",
      "components": ["V", "S", "M"],
      "material": "iron filings",
      "duration": "Concentration, up to 1 hour",
      "classes": ["cleric", "wizard"],
      "description": "A 10-foot-radius invisible Sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the Sphere, spells can't be cast, summoned creatures disappear, and magic items become mundane."
    },
    {
      "id": "antipathy_sympathy",
      "name": "Antipathy/Sympathy",
      "level": 8,
      "school": "Enchantment",
      "casting_time": "1 hour",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a mix of vinegar and honey",
      "duration": "10 days",
      "classes": ["bard", "druid", "wizard"],
      "description": "You choose an object within range or an area that is no larger than a 200-foot Cube. Then specify a kind of intelligent creature. You must either attract or repel the specified creatures for the duration. Antipathy causes Frightened condition; Sympathy draws creatures towards the target."
    },
    {
      "id": "clone",
      "name": "Clone",
      "level": 8,
      "school": "Necromancy",
      "casting_time": "1 hour",
      "range": "Touch",
      "components": ["V", "S", "M"],
      "material": "a diamond worth 1,000+ GP, a cubic inch of flesh of the creature to be cloned, and a vessel worth 2,000+ GP",
      "duration": "Instantaneous",
      "classes": ["wizard"],
      "description": "You grow an inert duplicate of a living creature as a safeguard against death. The clone forms inside a vessel and grows to full size and maturity after 120 days. At any time after the clone matures, if the original creature dies, its soul transfers to the clone if it is free and willing."
    },
    {
      "id": "control_weather",
      "name": "Control Weather",
      "level": 8,
      "school": "Transmutation",
      "casting_time": "10 minutes",
      "range": "Self (5-mile radius)",
      "components": ["V", "S", "M"],
      "material": "burning incense",
      "duration": "Concentration, up to 8 hours",
      "classes": ["cleric", "druid", "wizard"],
      "description": "You take control of the weather within 5 miles of you for the duration. When you cast the spell, you change the current weather conditions. The new conditions take effect after 1d4 × 10 minutes. You can change precipitation, temperature, and wind."
    },
    {
      "id": "demiplane",
      "name": "Demiplane",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["S"],
      "duration": "1 hour",
      "classes": ["sorcerer", "warlock", "wizard"],
      "description": "You create a shadowy door on a flat solid surface within range. The door is large enough to allow Medium creatures to pass through unhindered. It leads to a demiplane that appears to be an empty room 30 feet in each dimension, made of wood or stone."
    },
    {
      "id": "dominate_monster",
      "name": "Dominate Monster",
      "level": 8,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 hour",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You attempt to beguile a creature you can see within range. It must succeed on a Wisdom saving throw or have the Charmed condition for the duration. If you or creatures friendly to you are fighting it, the target has Advantage on the saving throw. While the target is Charmed, you have a telepathic link with it.",
      "at_higher_levels": "9th level: 8 hours duration."
    },
    {
      "id": "earthquake",
      "name": "Earthquake",
      "level": 8,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "500 feet",
      "components": ["V", "S", "M"],
      "material": "a fractured rock",
      "duration": "Concentration, up to 1 minute",
      "classes": ["cleric", "druid", "sorcerer"],
      "description": "You create a seismic disturbance at a point on the ground within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point. Each creature on the ground in the area must make a Dexterity saving throw or have the Prone condition. The spell can have additional effects depending on the terrain."
    },
    {
      "id": "feeblemind",
      "name": "Feeblemind",
      "level": 8,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S", "M"],
      "material": "a handful of clay, crystal, glass, or mineral spheres",
      "duration": "Instantaneous",
      "classes": ["bard", "druid", "warlock", "wizard"],
      "description": "You blast the mind of a creature you can see within range. The target makes an Intelligence saving throw. On a failed save, the target takes 4d6 Psychic damage and has the Incapacitated condition. Its Intelligence and Charisma scores become 1. It can't cast spells, activate magic items, understand language, or communicate in any intelligible way. The creature can repeat the saving throw every 30 days."
    },
    {
      "id": "glibness",
      "name": "Glibness",
      "level": 8,
      "school": "Transmutation",
      "casting_time": "Action",
      "range": "Self",
      "components": ["V"],
      "duration": "1 hour",
      "classes": ["bard", "warlock"],
      "description": "Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful."
    },
    {
      "id": "holy_aura",
      "name": "Holy Aura",
      "level": 8,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Self (30-foot emanation)",
      "components": ["V", "S", "M"],
      "material": "a tiny reliquary worth 1,000+ GP containing a sacred relic",
      "duration": "Concentration, up to 1 minute",
      "classes": ["cleric"],
      "description": "Divine light washes out from you in a 30-foot Emanation. Creatures of your choice in the Emanation when you cast this spell shed Dim Light in a 5-foot radius and have Advantage on all saving throws. Other creatures have Disadvantage on attack rolls against them. If a Fiend or Undead hits an affected creature, the aura flashes with blinding light, forcing the attacker to make a Constitution save or have the Blinded condition until the spell ends."
    },
    {
      "id": "illusory_dragon",
      "name": "Illusory Dragon",
      "level": 8,
      "school": "Illusion",
      "casting_time": "Action",
      "range": "120 feet",
      "components": ["S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["wizard"],
      "description": "By gathering threads of shadow material from the Shadowfell, you create a Huge shadowy dragon in an unoccupied space you can see within range. The illusion lasts for the duration and occupies its space. The dragon can use its breath weapon, forcing a Wisdom save or taking 7d6 damage of a type you choose."
    },
    {
      "id": "incendiary_cloud",
      "name": "Incendiary Cloud",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 1 minute",
      "classes": ["druid", "sorcerer", "wizard"],
      "description": "A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius Sphere centered on a point within range. The cloud spreads around corners and is Heavily Obscured. A creature that enters the cloud for the first time on a turn or starts its turn there must make a Dexterity saving throw, taking 10d8 Fire damage on a failed save, or half as much on a successful one. The cloud moves 10 feet directly away from you at the start of each of your turns."
    },
    {
      "id": "maddening_darkness",
      "name": "Maddening Darkness",
      "level": 8,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "M"],
      "material": "a drop of pitch mixed with a drop of mercury",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["warlock", "wizard"],
      "description": "Magical darkness spreads from a point you choose within range to fill a 60-foot-radius Sphere until the spell ends. The darkness spreads around corners. A creature with Darkvision can't see through this darkness. Nonmagical light can't illuminate it. A creature that starts its turn in the darkness must make a Wisdom saving throw, taking 8d8 Psychic damage on a failed save, or half on success."
    },
    {
      "id": "maze",
      "name": "Maze",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S"],
      "duration": "Concentration, up to 10 minutes",
      "classes": ["wizard"],
      "description": "You banish a creature you can see within range into a labyrinthine demiplane. The target remains there for the duration or until it escapes the maze. The target can use its action to attempt to escape. When it does so, it makes a DC 20 Intelligence check. If it succeeds, it escapes and reappears in the space it left or the nearest unoccupied space."
    },
    {
      "id": "mighty_fortress",
      "name": "Mighty Fortress",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "1 minute",
      "range": "1 mile",
      "components": ["V", "S", "M"],
      "material": "a diamond worth 500+ GP, which the spell consumes",
      "duration": "Instantaneous",
      "classes": ["wizard"],
      "description": "A fortress of stone erupts from a square area of ground of your choice. The fortress has four guard towers, walls, and a keep. You can create an interior divided into rooms of your choice with furnishings. If you cast this spell in the same spot once every 7 days for a year, the fortress becomes permanent."
    },
    {
      "id": "mind_blank",
      "name": "Mind Blank",
      "level": 8,
      "school": "Abjuration",
      "casting_time": "Action",
      "range": "Touch",
      "components": ["V", "S"],
      "duration": "24 hours",
      "classes": ["bard", "wizard"],
      "description": "Until the spell ends, one willing creature you touch has Immunity to Psychic damage, the Charmed condition, any effect that would sense its emotions or read its thoughts, and Divination spells."
    },
    {
      "id": "power_word_stun",
      "name": "Power Word Stun",
      "level": 8,
      "school": "Enchantment",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V"],
      "duration": "Instantaneous",
      "classes": ["bard", "sorcerer", "warlock", "wizard"],
      "description": "You speak a word of power that can overwhelm the mind of one creature you can see within range. If the target has 150 Hit Points or fewer, it has the Stunned condition. Otherwise, the spell has no effect on it. A Stunned target must make a Constitution saving throw at the end of each of its turns. On a successful save, this stunning effect ends."
    },
    {
      "id": "reality_break",
      "name": "Reality Break",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "Action",
      "range": "60 feet",
      "components": ["V", "S", "M"],
      "material": "a crystal prism",
      "duration": "Concentration, up to 1 minute",
      "classes": ["wizard"],
      "description": "You shatter the barriers between realities and timelines, thrusting a creature into turmoil and madness. The target must succeed on a Wisdom saving throw, or it can't take Reactions until the spell ends. At the start of each of its turns, the target must roll a d10 to determine the effect."
    },
    {
      "id": "sunburst",
      "name": "Sunburst",
      "level": 8,
      "school": "Evocation",
      "casting_time": "Action",
      "range": "150 feet",
      "components": ["V", "S", "M"],
      "material": "a piece of sunstone",
      "duration": "Instantaneous",
      "classes": ["cleric", "druid", "sorcerer", "wizard"],
      "description": "Brilliant sunlight flashes in a 60-foot-radius Sphere centered on a point you choose within range. Each creature in that light must make a Constitution saving throw. On a failed save, a creature takes 12d6 Radiant damage and has the Blinded condition for 1 minute. On a successful save, it takes half as much damage and isn't Blinded. Undead and oozes have Disadvantage on this saving throw."
    },
    {
      "id": "telepathy",
      "name": "Telepathy",
      "level": 8,
      "school": "Divination",
      "casting_time": "Action",
      "range": "Unlimited",
      "components": ["V", "S", "M"],
      "material": "a pair of linked silver rings",
      "duration": "24 hours",
      "classes": ["wizard"],
      "description": "You create a telepathic link between yourself and a willing creature with which you are familiar. The creature can be anywhere on the same plane of existence as you. Until the spell ends, you and the target can instantaneously share words, images, sounds, and other sensory messages with one another."
    },
    {
      "id": "tsunami",
      "name": "Tsunami",
      "level": 8,
      "school": "Conjuration",
      "casting_time": "1 minute",
      "range": "Sight",
      "components": ["V", "S"],
      "duration": "Concentration, up to 6 rounds",
      "classes": ["druid"],
      "description": "A wall of water springs into existence at a point you choose within range. The wall is up to 300 feet long, up to 300 feet high, and up to 50 feet thick. The wall lasts for the duration. When the wall appears, each creature within its area must make a Strength saving throw, taking 6d10 Bludgeoning damage on a failed save, or half as much on a successful one."
    }
  ]
}
