{
  "id": "goliath",
  "name": "Goliath",
  "source": "2024 Player's Handbook",
  "description": "Goliaths are mountain-dwelling beings who have stone-like skin and traces of Giant in their ancestry. Their heritage gives them supernatural power.",
  "creature_type": "Humanoid",
  "size": "Medium (about 7-8 feet tall)",
  "speed": 35,
  "languages": ["Common", "Giant"],
  "traits": [
    {
      "id": "giant_ancestry",
      "name": "Giant Ancestry",
      "description": "You are descended from Giants. Choose one of the following benefits—a supernatural boon from your ancestry; you can use the chosen benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a Long Rest.",
      "options": [
        {
          "id": "cloud_giant",
          "name": "Cloud's Jaunt (Cloud Giant)",
          "description": "As a Bonus Action, you magically teleport up to 30 feet to an unoccupied space you can see."
        },
        {
          "id": "fire_giant",
          "name": "Fire's Burn (Fire Giant)",
          "description": "When you hit a target with an attack roll and deal damage to it, you can also deal 1d10 Fire damage to that target."
        },
        {
          "id": "frost_giant",
          "name": "Frost's Chill (Frost Giant)",
          "description": "When you hit a target with an attack roll and deal damage to it, you can also deal 1d6 Cold damage to that target and reduce its Speed by 10 feet until the start of your next turn."
        },
        {
          "id": "hill_giant",
          "name": "Hill's Tumble (Hill Giant)",
          "description": "When you hit a Large or smaller creature with an attack roll and deal damage to it, you can give that target the Prone condition."
        },
        {
          "id": "stone_giant",
          "name": "Stone's Endurance (Stone Giant)",
          "description": "When you take damage, you can use your Reaction to roll 1d12. Add your Constitution modifier to the number rolled and reduce the damage by that total."
        },
        {
          "id": "storm_giant",
          "name": "Storm's Thunder (Storm Giant)",
          "description": "When you take damage from a creature within 60 feet of you, you can use your Reaction to deal 1d8 Thunder damage to that creature."
        }
      ]
    },
    {
      "id": "large_form",
      "name": "Large Form",
      "description": "Starting at 5th level, you can change your size to Large as a Bonus Action if you're in a big enough space. This transformation lasts for 10 minutes or until you end it (no action required). For that duration, you have Advantage on Strength checks, and your Speed increases by 10 feet. Once you use this trait, you can't use it again until you finish a Long Rest."
    },
    {
      "id": "powerful_build",
      "name": "Powerful Build",
      "description": "You have Advantage on any saving throw you make to end the Grappled condition. You also count as one size larger when determining your carrying capacity."
    }
  ],
  "ability_score_increases": {
    "notes_2024": "In 2024 rules, ability score increases come from your Background, not your Species."
  }
}
